# Use brew bundle install --global to install from here
tap "heroku/brew"

cask "arc"
cask "ableton-live-suite"
cask "dash"
cask "google-chrome"
# Not supported browser currently with work
#cask "brave-browser"
cask "pushplaylabs-sidekick"
cask "spotify"
cask "vlc"
cask "logseq"
cask "thunderbird"
cask "macvim"
cask "iterm2"
cask "dash"
cask "rectangle"
cask "flow"
cask "grammarly"
cask "grammarly-desktop"
cask "slack"
cask "whatsapp"
cask "obsidian"
cask "google-drive"
cask "todoist"
cask "ticktick"
cask "visual-studio-code"
cask "cloudflare-warp"
cask "tableplus"
cask "dbeaver-community"
cask "zoom"
cask "joplin"
cask "notion"
cask "orbstack"
cask "maccy"
cask "postman"
cask "raycast"

# version manager for ruby, node, etc
brew "asdf"
# for accessing secrets on the command line
brew "bitwarden-cli"
brew "kubectl"
# load and unload environment variables from .envrc and .env files based on 
# current folder and parent directories
brew "direnv"
# general purpose fuzzy finder useful for finding things and history
brew "fzf"
# postgres library required to build pg gem
brew "libpq"
brew "wget"
brew "heroku"
brew "gh"

# required by asdf for plugins but generally useful for building things
brew "gpg"
brew "gawk"

# required for ruby 3.2
brew "rust"

mas "bitwarden", id: 1352778147

# better git diff
brew "delta"

mas "perplexity-ask-anything", id: 6714467650
