tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

# Dev tools
brew 'pcre'
brew 'xz'
brew 'the_silver_searcher'
brew 'git'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-use'
brew 'ruby-build'
brew 'python'
brew 'qt'
brew 'wget'

# Utils
brew 'mackup'

# Applications
cask 'alfred'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
cask 'firefox'
cask 'licecap'
cask 'pgadmin3'
cask 'skype'
cask 'flux'
cask 'macdown'
cask 'spotify'
cask 'rubymine'

# quick-look-plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown' 
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv' 
cask 'betterzipql' 
cask 'qlimagesize' 
cask 'webpquicklook' 
cask 'suspicious-package'

