cask "ableton-live-suite"
cask "dash"
cask "docker"
cask "google-chrome"
cask "spotify"
cask "vlc"
cask "logseq"
cask "thunderbird"
cask "macvim"
cask "iterm2"
cask "dash"
cask "rectangle"
cask "flow"
cask "grammarly"
cask "grammarly-desktop"
cask "slack"
cask "whatsapp"
cask "obsidian"
cask "google-drive"
cask "todoist"


# version manager for ruby, node, etc
brew "asdf"
# for accessing secrets on the command line
brew "bitwarden-cli"
# load and unload environment variables from .envrc and .env files based on 
# current folder and parent directories
brew "direnv"
# general purpose fuzzy finder useful for finding things and history
brew "fzf"
# postgres library required to build pg gem
brew "libpq"
brew "wget"

# required by asdf for plugins but generally useful for building things
brew "gpg"
brew "gawk"

mas "bitwarden", id: 1352778147

